

<!DOCTYPE html>
<html lang="zh-CN" data-default-color-scheme=auto>



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/fluid.png">
  <link rel="icon" href="/img/fluid.png">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=5.0, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="author" content="peiwithhao">
  <meta name="keywords" content="">
  
    <meta name="description" content="2023羊城杯部分赛题复现shellcode12345678910111213141516171819202122232425262728293031323334353637383940unsigned __int64 __fastcall vuln(const char *a1)&amp;#123;  int v2; &#x2F;&#x2F; [rsp+14h] [rbp-3Ch]  void **buf; &#x2F;&#x2F; [rsp">
<meta property="og:type" content="article">
<meta property="og:title" content="羊城杯部分赛题复现">
<meta property="og:url" content="https://peiandhao.github.io/2023/09/14/%E7%BE%8A%E5%9F%8E%E6%9D%AF%E9%83%A8%E5%88%86%E8%B5%9B%E9%A2%98%E5%A4%8D%E7%8E%B0/index.html">
<meta property="og:site_name" content="peiwithhao&#39;s Valhalla">
<meta property="og:description" content="2023羊城杯部分赛题复现shellcode12345678910111213141516171819202122232425262728293031323334353637383940unsigned __int64 __fastcall vuln(const char *a1)&amp;#123;  int v2; &#x2F;&#x2F; [rsp+14h] [rbp-3Ch]  void **buf; &#x2F;&#x2F; [rsp">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://peiandhao.github.io/img/yangcheng.jpg">

<figure class="highlight nestedtext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><code class="hljs nestedtext"><span class="hljs-attribute">&#x27;[*] &#x27;/home/peiwithhao/Downloads/pwn&#x27;</span><br><span class="hljs-attribute">    Arch</span><span class="hljs-punctuation">:</span> <span class="hljs-string">    amd64-64-little</span><br>    <span class="hljs-attribute">RELRO</span><span class="hljs-punctuation">:</span> <span class="hljs-string">   Full RELRO</span><br>    <span class="hljs-attribute">Stack</span><span class="hljs-punctuation">:</span> <span class="hljs-string">   Canary found</span><br>    <span class="hljs-attribute">NX</span><span class="hljs-punctuation">:</span> <span class="hljs-string">      NX enabled</span><br>    <span class="hljs-attribute">PIE</span><span class="hljs-punctuation">:</span> <span class="hljs-string">     PIE enabled</span><br>    <span class="hljs-attribute">RUNPATH</span><span class="hljs-punctuation">:</span> <span class="hljs-string"> b&#x27;./&#x27;</span><br><br></code></pre></td></tr></table></figure>

<p>题目版本为glibc-2.35,题目逆向方面，漏洞即为uaf,且修改部分限制了只有两次，且限制了题目申请的堆块大小，只能申请到部分largebin,所以题目中我们采用两次largebin attack进行地址任意写</p>
<figure class="highlight dart"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><code class="hljs dart"><span class="hljs-keyword">void</span> delete()<br>&#123;<br>  unsigned __int64 <span class="hljs-built_in">num</span>; <span class="hljs-comment">// [rsp+8h] [rbp-8h]</span><br><br>  my_write(<span class="hljs-string">&quot;plz input your cat idx:\n&quot;</span>);<br>  <span class="hljs-built_in">num</span> = (unsigned <span class="hljs-built_in">int</span>)get_num();<br>  <span class="hljs-keyword">if</span> ( <span class="hljs-built_in">num</span> &lt;= <span class="hljs-number">0xF</span> &amp;&amp; *((_QWORD *)&amp;chunk_ptr + <span class="hljs-built_in">num</span>) )<br>    free(*((<span class="hljs-keyword">void</span> **)&amp;chunk_ptr + <span class="hljs-built_in">num</span>));<br>  <span class="hljs-keyword">else</span><br>    my_write(<span class="hljs-string">&quot;invalid!\n&quot;</span>);<br>&#125;<br></code></pre></td></tr></table></figure>

<p>首先我们第一次写stderr指针内容为我们堆块上的一个地址，这样我们就可以创建一个虚假的<code>_IO_2_1_stderr</code>,因此我们也可以修改其vtable的指针，但是由于高版本IO的限制，其中对于vtable的地址需要处于一定段之中，但是对于其中的具体地址却检查的并不细致，所以我们可以对于其中vtable的指针进行一个偏移，这里我们如果将stderr指向的结构体中vtable变为<code>_IO_wfile_jumps+0x10</code>,那么本该调用<code>__xsputn</code>就会调用到<code>__seekoff</code></p>
<figure class="highlight sqf"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><code class="hljs sqf"><span class="hljs-comment">/* offset      |    size */</span>  <span class="hljs-built_in">type</span> = struct <span class="hljs-variable">_IO_jump_t</span> &#123;<br><span class="hljs-comment">/*      0      |       8 */</span>    size_t <span class="hljs-variable">__dummy</span>;<br><span class="hljs-comment">/*      8      |       8 */</span>    size_t <span class="hljs-variable">__dummy2</span>;<br><span class="hljs-comment">/*     16      |       8 */</span>    <span class="hljs-variable">_IO_finish_t</span> <span class="hljs-variable">__finish</span>;<br><span class="hljs-comment">/*     24      |       8 */</span>    <span class="hljs-variable">_IO_overflow_t</span> <span class="hljs-variable">__overflow</span>;<br><span class="hljs-comment">/*     32      |       8 */</span>    <span class="hljs-variable">_IO_underflow_t</span> <span class="hljs-variable">__underflow</span>;<br><span class="hljs-comment">/*     40      |       8 */</span>    <span class="hljs-variable">_IO_underflow_t</span> <span class="hljs-variable">__uflow</span>;<br><span class="hljs-comment">/*     48      |       8 */</span>    <span class="hljs-variable">_IO_pbackfail_t</span> <span class="hljs-variable">__pbackfail</span>;<br><span class="hljs-comment">/*     56      |       8 */</span>    <span class="hljs-variable">_IO_xsputn_t</span> <span class="hljs-variable">__xsputn</span>;<br><span class="hljs-comment">/*     64      |       8 */</span>    <span class="hljs-variable">_IO_xsgetn_t</span> <span class="hljs-variable">__xsgetn</span>;<br><span class="hljs-comment">/*     72      |       8 */</span>    <span class="hljs-variable">_IO_seekoff_t</span> <span class="hljs-variable">__seekoff</span>;<br><span class="hljs-comment">/*     80      |       8 */</span>    <span class="hljs-variable">_IO_seekpos_t</span> <span class="hljs-variable">__seekpos</span>;<br><span class="hljs-comment">/*     88      |       8 */</span>    <span class="hljs-variable">_IO_setbuf_t</span> <span class="hljs-variable">__setbuf</span>;<br><span class="hljs-comment">/*     96      |       8 */</span>    <span class="hljs-variable">_IO_sync_t</span> <span class="hljs-variable">__sync</span>;<br><span class="hljs-comment">/*    104      |       8 */</span>    <span class="hljs-variable">_IO_doallocate_t</span> <span class="hljs-variable">__doallocate</span>;<br><span class="hljs-comment">/*    112      |       8 */</span>    <span class="hljs-variable">_IO_read_t</span> <span class="hljs-variable">__read</span>;<br><span class="hljs-comment">/*    120      |       8 */</span>    <span class="hljs-variable">_IO_write_t</span> <span class="hljs-variable">__write</span>;<br><span class="hljs-comment">/*    128      |       8 */</span>    <span class="hljs-variable">_IO_seek_t</span> <span class="hljs-variable">__seek</span>;<br><span class="hljs-comment">/*    136      |       8 */</span>    <span class="hljs-variable">_IO_close_t</span> <span class="hljs-variable">__close</span>;<br><span class="hljs-comment">/*    144      |       8 */</span>    <span class="hljs-variable">_IO_stat_t</span> <span class="hljs-variable">__stat</span>;<br><span class="hljs-comment">/*    152      |       8 */</span>    <span class="hljs-variable">_IO_showmanyc_t</span> <span class="hljs-variable">__showmanyc</span>;<br><span class="hljs-comment">/*    160      |       8 */</span>    <span class="hljs-variable">_IO_imbue_t</span> <span class="hljs-variable">__imbue</span>;<br><br></code></pre></td></tr></table></figure>

<p>而house of cat就是利用到了调用到了__seekoff，从源码我们可以查看</p>
<p>首先就是借鉴house of kiwi的思想，触发<code>__malloc_assert</code>来进行利用，然后会调用</p>
